# StructuralBeamEndSupport Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralBeamEndSupport Property
ParameterTypeId Class See Also
---
"Beam End Pocket Seat"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralBeamEndSupport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralBeamEndSupport As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralBeamEndSupport {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace